[LWS_Vanguard X2SoldierClassTemplate]
+DisplayName="先锋"
+ClassSummary="XCOM的先锋是前线作战人员，在自动武器和爆炸物的时代，只有少数人能够掌握近战格斗的艺术。先锋仅携带霰弹枪和可能的盾牌或手枪，他们可以被训练成吸收伤害、尽可能让敌人行动变得痛苦，或者简单地用他们的霰弹枪将敌人炸成碎片。"
;************************************************************************************************************
;***                                  Note - Vanguards are semi-heroic***
;************************************************************************************************************
+LeftAbilityTreeTitle="铅风暴"
+RightAbilityTreeTitle="惩罚者"
AbilityTreeTitles[0]="铅风暴"
AbilityTreeTitles[1]="前线战士"
AbilityTreeTitles[2]="惩罚者"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

[Mrv_Sidewinder X2AbilityTemplate]
LocFriendlyName="子弹时间"
LocLongDescription="如果士兵将要被敌人的直接攻击击中，士兵将完全躲避这次攻击并获得一个仅限移动的行动点。3回合充能。警告 - 可能会被友方的爆炸物如烟雾手榴弹意外激活。"
LocHelpText="如果士兵将要被敌人的直接攻击击中，躲避攻击并立即移动到你选择的更好位置。先锋将能够使用这个仅限移动的行动点激活一些他们的能力，如守护或踢击。"
LocPromotionPopupText="<Bullet/> 如果士兵正在束缚目标（如果是毒蛇而非人类）， 子弹时间将不会激活。<br/><Bullet/> 子弹时间不会对抗敌人的反应射击。<br/><Bullet/> 覆盖一片区域的攻击仍可能伤害士兵，即使是无害的爆炸如烟雾手榴弹也能触发这个能力。"

[Mrv_SidewinderCooldown X2AbilityTemplate]
LocLongDescription="士兵需要休息一下，才能再次躲避攻击。"
LocHelpText="士兵需要休息一下，才能再次躲避攻击。"

[Mrv_SidewinderDodge X2AbilityTemplate]
LocFriendlyName="子弹时间疲劳"
LocLongDescription="士兵需要休息一下，才能再次躲避攻击。"
LocHelpText="士兵需要休息一下，才能再次躲避攻击。"

[IRI_Rider_Riposte X2AbilityTemplate]
LocLongDescription="使用主武器来反击那些本将未命中或擦伤的敌人攻击，或者在 <font color='#ff3206'>守护</font> 激活时。被动获得 <Ability:RIPOSTE_BONUS_DODGE/> 闪避，并抵抗大多数由近战攻击命中施加的负面效果。风暴骑士将使用他们的剑进行攻击，先锋将使用他们的霰弹枪作为临时近战武器。"
LocHelpText="使用主武器（近战/霰弹枪）来反击那些本将未命中或擦伤的敌人攻击，或者在 <font color='#ff3206'>守护</font> 激活时。被动获得 <Ability:RIPOSTE_BONUS_DODGE/> 闪避，并抵抗大多数由近战攻击命中施加的负面效果。"
LocPromotionPopupText="<Bullet/> 任何在近战范围内进行的攻击都可以被反击，即使它是用远程武器发动的。<br/><bullet/> 反击攻击可以完全避免它，并自动以反击回应。<br/><bullet/> 如果敌人免疫反应射击，则无法反击。<br/><bullet/> 反击攻击被视为反应攻击；它会受到命中惩罚，通常无法暴击。<br/><bullet/> 反击攻击只造成主武器的伤害，即使是在双持武器时，它也无法激活 <font color='#ff3206'>交叉打击</font>。<br/><bullet/> 学习反击将使士兵永久免疫由晕眩枪兵、突变体和狂战士执行的近战攻击的负面效果。<br/><bullet/> 如果 <font color='#ff3206'>守护</font> 激活，它的充能将被用来反击敌人的攻击，如果可能的话。"

[Mrv_ThroughTheFrontDoor X2AbilityTemplate]
LocFriendlyName="正门突破"
LocLongDescription="士兵获得掠夺者和擦弹射击能力。"
LocHelpText="掠夺者能力允许士兵射击而不结束回合，擦弹射击则能让士兵倾泻子弹，最终总会击中某些东西——比如处于警戒状态的敌人。"
LocPromotionPopupText="<Bullet/> 使用掠夺者能力来撕碎接近先锋的敌人，连续两次霰弹枪射击足以杀死大多数敌人，或者进行标准射击后接重击。<br/><Bullet/> 擦弹射击提升了警戒能力，即使是轻微擦伤也能阻止反应攻击，有了掠夺者天赋，你的先锋可以简单地继续射击即使是远距离的目标，将他们远远地擦伤，即使只是擦伤也能打断压制或警戒。<br/>"

[Mrv_GuardianSpirit X2AbilityTemplate]
LocFriendlyName="守护精神"
LocLongDescription="士兵获得守护和锁定装填能力。"
LocHelpText="使用盾牌时，守护能力能让先锋吸收敌人的攻击，锁定装填则能在他们积累击杀时保持弹药充足。"
LocPromotionPopupText="<Bullet/> 使用守护能力为你的团队承受攻击。<br/><Bullet/> 一旦士兵学会了近战专家天赋，锁定装填将非常有用。<br/>"

[Mrv_SlayerOfTheEldritch X2AbilityTemplate]
LocFriendlyName="古神杀手"
LocLongDescription="士兵获得闪电踢和坚定不移能力。"
LocHelpText="闪电踢的伤害随等级提升，坚定不移将为闪电踢生成一个仅限移动的行动点。"
LocPromotionPopupText="<Bullet/> 使用闪电踢来消灭躲在掩体后的敌人。<br/><Bullet/> 使用霰弹枪击杀敌人可以助力闪电踢的激活，所以保持先锋靠近战场。<br/>"
